name: "dummy_cpu_onnx"
backend: "onnxruntime"
max_batch_size: 64

dynamic_batching {
    max_queue_delay_microseconds: 300
    preserve_ordering: true
}

# No execution_accelerators -> ONNX Runtime uses CPUExecutionProvider only
optimization {
    input_pinned_memory {
        enable: false
    }
}

input: [
    { name: "input", data_type: TYPE_FP32, dims: [8] }
]
output: [
    { name: "output", data_type: TYPE_FP32, dims: [4] }
]

instance_group [
    { kind: KIND_CPU, count: 1 }
]
